/**
 * Копіює у цільвий об'єкт властивості обєктів які копіюються.
 * Якщо у ціловому обєкті є такі самі поля як і у тому що копіюються то властивості тих полів у цільвому обє'кті заміняться на ті що копіюються.
 * Якщо існують такі самі поля і у наступних обєктах які копіюються то значення тих властивостей заміняться на властивості пізніших об'єктів.
 * @param target - цільовий об'єкт.
 * @param ...sources - вхідні об'єкти.
 * return target З НОВИМИ ВЛАСТИВОСТЯМИ
 */

// Object.assign(target, ...sources)

const obj1 = {
    name: 'Roman'
};
console.log(obj1); // { name: 'Roman' }

const assignObj = Object.assign(obj1, {lastName: 'Myk', age: '33'}, {age: '18'});

console.log(assignObj); // { name: 'Roman', lastName: 'Myk', age: '18' }
console.log(obj1 === assignObj); // true - бо повертає цільовий об'єкт!!!
// Цільовий обєкт буде прототипом!!!
// Поверхнева копія
// Властивості прототипів не копіюються
// Властивості які не перелічуються (enumerable: false)
